Repository: Greekforce1821/el-LFS
Catalog: */chapter01/askforhelp.po
Languages: el

source: Help
el: Βοήθεια

source: In case you've hit an issue building one package with the LFS instruction, we strongly discourage posting the issue directly onto the upstream support channel before discussing via a LFS support channel listed in <xref linkend="ch-intro-resources"/>. Doing so is often quite inefficient because the upstream maintainers are rarely familiar with LFS building procedure. Even if you've really hit an upstream issue, the LFS community can still help to isolate the information wanted by the upstream maintainers and make a proper report.
el: Σε περίπτωση που αντιμετωπίζετε πρόβλημα κατά τη διάρκεια της δημιουργίας ενός πακέτου με τις οδηγίες του LFS, συνιστούμε ανεπιφύλακτα να μην αναρτάτε το πρόβλημα απευθείας στο υποστηρικτικό κανάλι του δημιουργού πακέτου πριν συζητήσετε το ζήτημα μέσω ενός υποστηρικτικού καναλιού του LFS που αναφέρεται στην ενότητα <xref linkend="ch-intro-resources"/>. Αυτό είναι συχνά ανεπαρκές, καθώς οι διαχειριστές του δημιουργού πακέτου σπάνια είναι εξοικειωμένοι με τις διαδικασίες δημιουργίας του LFS. Ακόμα και αν πρόκειται για πραγματικό πρόβλημα του δημιουργού του πακέτου, η κοινότητα του LFS μπορεί ακόμα να σας βοηθήσει να απομονώσετε τις πληροφορίες που χρειάζονται οι διαχειριστές του δημιουργού πακέτου και να καταθέσετε μια κατάλληλη αναφορά.

source: If you must ask a question directly via an upstream support channel, you shall at least note that many upstream projects have the support channels separated from the bug tracker. The <quote>bug</quote> reports for asking questions are considered invalid and may annoy upstream developers for these projects.
el: Εάν πρέπει να κάνετε μια ερώτηση απευθείας μέσω ενός υποστηρικτικού καναλιού του δημιουργού πακέτου, πρέπει τουλάχιστον να σημειώσετε ότι πολλά έργα διαχωρίζουν τα κανάλια υποστήριξης από τον ανιχνευτή σφαλμάτων. Οι αναφορές <quote>σφαλμάτων</quote> για ερωτήσεις θεωρούνται μη έγκυρες και ενδέχεται να ενοχλήσουν τους δημιουργούς του πρότζεκτ αυτών των έργων.

source: If an issue or a question is encountered while working through this book, please check the FAQ page at <ulink url="&faq-root;#generalfaq"/>. Questions are often already answered there. If your question is not answered on that page, try to find the source of the problem. The following hint will give you some guidance for troubleshooting: <ulink url="&hints-root;errors.txt"/>.
el: Εάν αντιμετωπίσετε ένα θέμα ή μια ερώτηση κατά τη διάρκεια της εργασίας με αυτό το βιβλίο, παρακαλούμε ελέγξτε τη σελίδα FAQ στη διεύθυνση <ulink url="&faq-root;#generalfaq"/>. Συχνά, οι ερωτήσεις έχουν ήδη απαντηθεί εκεί. Εάν η ερώτησή σας δεν απαντάται σε αυτήν τη σελίδα, προσπαθήστε να εντοπίσετε την πηγή του προβλήματος. Το ακόλουθο υπόδειγμα θα σας δώσει κάποιες κατευθυντήριες γραμμές για την επίλυση προβλημάτων: <ulink url="&hints-root;errors.txt"/>.

source: If you cannot find your problem listed in the FAQ, search the mailing lists at <ulink url="&lfs-root;search.html"/>.
el: Εάν δεν μπορείτε να βρείτε το πρόβλημά σας στη λίστα των συχνών ερωτήσεων (FAQ), αναζητήστε τις λίστες ταχυδρομείου στη διεύθυνση <ulink url="&lfs-root;search.html"/>.

source: We also have a wonderful LFS community that is willing to offer assistance through the mailing lists and IRC (see the <xref linkend="ch-intro-resources"/> section of this book). However, we get several support questions every day, and many of them could have been easily answered by going to the FAQ or by searching the mailing lists first. So, for us to offer the best assistance possible, you should first do some research on your own. That allows us to focus on the more unusual support needs. If your searches do not produce a solution, please include all the relevant information (mentioned below) in your request for help.
el: Έχουμε επίσης μια υπέροχη κοινότητα LFS που είναι πρόθυμη να προσφέρει βοήθεια μέσω των λιστών ταχυδρομείου και του IRC (δείτε την ενότητα <xref linkend="ch-intro-resources"/> αυτού του βιβλίου). Ωστόσο, λαμβάνουμε αρκετές ερωτήσεις υποστήριξης καθημερινά, και πολλές από αυτές θα μπορούσαν να απαντηθούν εύκολα πηγαίνοντας πρώτα στις συχνές ερωτήσεις (FAQ) ή αναζητώντας τις λίστες ταχυδρομείου. Επομένως, για να προσφέρουμε την καλύτερη δυνατή βοήθεια, θα πρέπει πρώτα να κάνετε μερικές έρευνες μόνοι σας. Αυτό μας επιτρέπει να επικεντρωθούμε στις πιο ασυνήθεις ανάγκες υποστήριξης. Εάν οι έρευνές σας δεν οδηγήσουν σε μια λύση, παρακαλούμε συμπεριλάβετε όλες τις σχετικές πληροφορίες (που αναφέρονται παρακάτω) στο αίτημα βοήθειας σας.

source: Things to Mention
el: Πράγματα που πρέπει να Αναφερθούν

source: Apart from a brief explanation of the problem being experienced, any request for help should include these essential things:
el: Εκτός από μια σύντομη εξήγηση του προβλήματος που αντιμετωπίζετε, κάθε αίτημα βοήθειας θα πρέπει να περιλαμβάνει αυτά τα απαραίτητα στοιχεία:

source: The version of the book being used (in this case &version;)
el: Την έκδοση του βιβλίου που χρησιμοποιήσατε (σε αυτήν την περίπτωση &version;)

source: The host distribution and version being used to create LFS
el: Την διανομή του ξενιστή και την έκδοση που χρησιμοποιήσατε για να δημιουργήσετε το LFS

source: The output from the <xref linkend='version-check'/> script
el: Την έξοδο από το <xref linkend='version-check'/> script

source: The package or section the problem was encountered in
el: Το πακέτο ή την ενότητα που ήρθατε αντιμέτωποι με το πρόβλημα

source: The exact error message, or a clear description of the problem
el: Το ακριβές μήνυμα σφάλματος, ή μια καθαρή περιγραφή του προβλήματος

source: Note whether you have deviated from the book at all
el: Σημειώστε αν έχετε αποκλίνει από το βιβλίο σε οποιοδήποτε σημείο

source: Deviating from this book does <emphasis>not</emphasis> mean that we will not help you. After all, LFS is about personal preference. Being up-front about any changes to the established procedure helps us evaluate and determine possible causes of your problem.
el: Αποκλίνοντας από αυτό το βιβλίο <emphasis>δεν</emphasis> σημαίνει ότι δεν θα σας βοηθήσουμε. Τελικά, το LFS αφορά τις προσωπικές προτιμήσεις. Το να είστε ειλικρινείς σχετικά με οποιεσδήποτε αλλαγές στην καθιερωμένη διαδικασία μας βοηθά να αξιολογήσουμε και να καθορίσουμε πιθανές αιτίες του προβλήματός σας.

source: Configure Script Problems
el: Προβλήματα με το Σενάριο Διαμόρφωσης

source: If something goes wrong while running the <command>configure</command> script, review the <filename>config.log</filename> file. This file may contain errors encountered during <command>configure</command> which were not printed to the screen. Include the <emphasis>relevant</emphasis> lines if you need to ask for help.
el: Εάν κάτι πάει στραβά κατά την εκτέλεση του σεναρίου <command>configure</command>, εξετάστε το αρχείο <filename>config.log</filename>. Αυτό το αρχείο μπορεί να περιέχει σφάλματα που εντοπίστηκαν κατά τη διάρκεια της εκτέλεσης του <command>configure</command> και που δεν εκτυπώθηκαν στην οθόνη. Συμπεριλάβετε τις <emphasis>σχετικές</emphasis> γραμμές αν χρειάζεστε βοήθεια.

source: Compilation Problems
el: Προβλήματα Μεταγλώττισης

source: Both the screen output and the contents of various files are useful in determining the cause of compilation problems. The screen output from the <command>configure</command> script and the <command>make</command> run can be helpful. It is not necessary to include the entire output, but do include all of the relevant information. Here is an example of the type of information to include from the <command>make</command> screen output.
el: Τόσο η έξοδος στην οθόνη όσο και το περιεχόμενο διάφορων αρχείων είναι χρήσιμα για τον προσδιορισμό των αιτιών για τα προβλημάτα μεταγλώττισης. Η έξοδος στην οθόνη από το σενάριο <command>configure</command> και η διαδικασία εκτέλεσης της εντολής <command>make</command> μπορεί να είναι χρήσιμες. Δεν είναι απαραίτητο να συμπεριλάβετε ολόκληρη την έξοδο, αλλά περιλάβετε όλες τις σχετικές πληροφορίες. Εδώ υπάρχει ένα παράδειγμα του είδους των πληροφοριών που πρέπει να συμπεριληφθούν από την έξοδο στην οθόνη της εντολής <command>make</command>.

source: In this case, many people would just include the bottom section:
el: Σε αυτήν την περίπτωση, πολλοί θα περιλάμβαναν απλώς την τελευταία ενότητα:

source: This is not enough information to diagnose the problem, because it only notes that something went wrong, not <emphasis>what</emphasis> went wrong. The entire section, as in the example above, is what should be saved because it includes the command that was executed and all the associated error messages.
el: Αυτό η πληροφορία όμως δεν επαρκεί για να διαγνώσετε το πρόβλημα, διότι αναφέρει μόνο ότι κάτι πήγε στραβά, χωρίς να δείχνει <emphasis>τι</emphasis> πήγε στραβά. Ολόκληρη η ενότητα, όπως στο παράδειγμα παραπάνω, είναι αυτή που πρέπει να αποθηκευθεί, διότι περιλαμβάνει την εντολή που εκτελέστηκε και όλα τα σχετικά μηνύματα σφάλματος.

source: An excellent article about asking for help on the Internet is available online at <ulink url="http://catb.org/~esr/faqs/smart-questions.html"/>. Read this document, and follow the hints. Doing so will increase the likelihood of getting the help you need.
el: Ένα εξαιρετικό άρθρο σχετικά με το πώς να ζητάτε βοήθεια στο Διαδίκτυο είναι διαθέσιμο σε απευθείας σύνδεση στη διεύθυνση <ulink url="http://catb.org/~esr/faqs/smart-questions.html"/>. Διαβάστε αυτό το έγγραφο και ακολουθήστε τις συμβουλές. Με αυτόν τον τρόπο, αυξάνετε τις πιθανότητες να λάβετε τη βοήθεια που χρειάζεστε.
