Repository: Greekforce1821/el-LFS
Catalog: */chapter01/changelog.po
Languages: el

source: Changelog
el: Αρχείο Αλλαγών

source: This is version &version; of the Linux From Scratch book, dated &releasedate;. If this book is more than six months old, a newer and better version is probably already available. To find out, please check one of the mirrors via <ulink url="&lfs-root;mirrors.html"/>.
el: Αυτή είναι η έκδοση &version; του βιβλίου Linux From Scratch, με ημερομηνία &releasedate;. Εάν αυτό το βιβλίο είναι παλαιότερο από έξι μήνες, πιθανόν να υπάρχει ήδη διαθέσιμη μια νεότερη και βελτιωμένη έκδοση. Για να το ελέγξετε, παρακαλούμε ελέγξτε έναν από τους mirror ιστοτόπους μέσω της διεύθυνσης <ulink url="&lfs-root;mirrors.html"/>.

source: Below is a list of changes made since the previous release of the book.
el: Παρακάτω υπάρχει μια λίστα αλλαγών που έχουν γίνει από την προηγούμενη έκδοση του βιβλίου.

source: Changelog Entries:
el: Καταχωρήσεις αλλαγών:

source: [bdubbs] - LFS-12.0 released.
el: [bdubbs] - H κυκλοφόρηση του LFS-12.0.

source: [bdubbs] - Update to linux-6.4.12. Fixes <ulink url='&lfs-ticket-root;5320'>#5320</ulink>.
el: [bdubbs] - Ενημέρωση σε linux-6.4.12. Διορθώσεις <ulink url='&lfs-ticket-root;5320'>#5320</ulink>.

source: [bdubbs] - Update to udev-lfs-20230818.
el: [bdubbs] - Ενημέρωση του udev-lfs-20230818.

source: [bdubbs] - Add a patch to fix a performance regression in glibc's posix_memalign() function. Fixes <ulink url='&lfs-ticket-root;5315'>#5315</ulink>.
el: [bdubbs] - Προστέθηκε ένα patch για να διορθωθεί μια επιδείνωση της απόδοσης στην συνάρτηση glibc's posix_memalign(). Διορθώσεις <ulink url='&lfs-ticket-root;5315'>#5315</ulink>.

source: [bdubbs] - Update to less-643. Fixes <ulink url='&lfs-ticket-root;5317'>#5317</ulink>.
el: [bdubbs] - Ενημέρωση του less-643. Διορθώσεις <ulink url='&lfs-ticket-root;5317'>#5317</ulink>.

source: [bdubbs] - Update to meson-1.2.1. Fixes <ulink url='&lfs-ticket-root;5314'>#5314</ulink>.
el: [bdubbs] - Ενημέρωση του meson-1.2.1. Διορθώσεις<ulink url='&lfs-ticket-root;5314'>#5314</ulink>.

source: [bdubbs] - Update to linux-6.4.10. Fixes <ulink url='&lfs-ticket-root;5313'>#5313</ulink>.
el: [bdubbs] - Ενημέρωση του linux-6.4.10. Διορθώσεις<ulink url='&lfs-ticket-root;5313'>#5313</ulink>.

source: [bdubbs] - Update to iana-etc-20230810. Addresses <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
el: [bdubbs] - Ενημέρωση του iana-etc-20230810. Αναφορές <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.

source: [rahul] - Update to pkgconf-2.0.1. Fixes <ulink url='&lfs-ticket-root;5316'>#5316</ulink>.
el: [rahul] - Ενημέρωση του pkgconf-2.0.1. Διορθώσεις <ulink url='&lfs-ticket-root;5316'>#5316</ulink>.

source: [bdubbs] - Update to xz-5.4.4. Fixes <ulink url='&lfs-ticket-root;5307'>#5307</ulink>.
el: [bdubbs] - Ενημέρωση του xz-5.4.4. Διορθώσεις <ulink url='&lfs-ticket-root;5307'>#5307</ulink>.

source: [bdubbs] - Update to wheel-0.41.1 (Python Module). Fixes <ulink url='&lfs-ticket-root;5311'>#5311</ulink>.
el: [bdubbs] - Ενημέρωση του wheel-0.41.1 (Python Module). Διορθώσεις <ulink url='&lfs-ticket-root;5311'>#5311</ulink>.

source: [bdubbs] - Update to man-pages-6.05.01. Fixes <ulink url='&lfs-ticket-root;5306'>#5306</ulink>.
el: [bdubbs] - Ενημέρωση του man-pages-6.05.01. Διορθώσεις <ulink url='&lfs-ticket-root;5306'>#5306</ulink>.

source: [bdubbs] - Update to linux-6.4.8. Fixes <ulink url='&lfs-ticket-root;5309'>#5309</ulink>.
el: [bdubbs] - Ενημέρωση του linux-6.4.8. Διορθώσεις <ulink url='&lfs-ticket-root;5309'>#5309</ulink>.

source: [bdubbs] - Update to iana-etc-20230804. Addresses <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
el: [bdubbs] - Ενημέρωση του iana-etc-20230804. Αναφορές <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.

source: [rahul] - Update to pkgconf-2.0.0. Fixes <ulink url='&lfs-ticket-root;5310'>#5310</ulink>.
el: [rahul] - Ενημέρωση του pkgconf-2.0.0. Διορθώσεις <ulink url='&lfs-ticket-root;5310'>#5310</ulink>.

source: [bdubbs] - Update to vim-9.0.1677. Addresses <ulink url='&lfs-ticket-root;4500'>#4500</ulink>.
el: [bdubbs] - Ενημερώσεις του vim-9.0.1677. Αναφορές <ulink url='&lfs-ticket-root;4500'>#4500</ulink>.

source: [bdubbs] - Update to openssl-3.1.2. Fixes <ulink url='&lfs-ticket-root;5305'>#5305</ulink>.
el: [bdubbs] - Ενημέρωση του openssl-3.1.2. Διορθώσεις <ulink url='&lfs-ticket-root;5305'>#5305</ulink>.

source: [bdubbs] - Update to man-pages-6.05. Fixes <ulink url='&lfs-ticket-root;5303'>#5303</ulink>.
el: [bdubbs] - Ενημέρωση του man-pages-6.05. Διορθώσεις <ulink url='&lfs-ticket-root;5303'>#5303</ulink>.

source: [bdubbs] - Update to binutils-2.41. Fixes <ulink url='&lfs-ticket-root;5300'>#5300</ulink>.
el: [bdubbs] - Ενημέρωση του binutils-2.41. Διορθώσεις <ulink url='&lfs-ticket-root;5300'>#5300</ulink>.

source: [bdubbs] - Update to gmp-6.3.0. Fixes <ulink url='&lfs-ticket-root;5301'>#5301</ulink>.
el: [bdubbs] - Ενημέρωση του gmp-6.3.0. Διορθώσεις <ulink url='&lfs-ticket-root;5301'>#5301</ulink>.

source: [bdubbs] - Update to glibc-2.38. Fixes <ulink url='&lfs-ticket-root;5302'>#5302</ulink>.
el: [bdubbs] - Ενημέρωση του glibc-2.38. Διορθώσεις <ulink url='&lfs-ticket-root;5302'>#5302</ulink>.

source: [bdubbs] - Update udev-lfs tarball to remove obsolete cdrom rules and references to ISDN devices. Fixes <ulink url='&lfs-ticket-root;5291'>#5291</ulink>.
el: [bdubbs] - Ενημέρωση του udev-lfs tarball για την αφαίρεση ξεπερασμένων cdrom κανόνων και αναφορών για ISDN συσκευές. Διορθώσεις <ulink url='&lfs-ticket-root;5291'>#5291</ulink>.

source: [bdubbs] - Update to wheel-0.41.0 (Python Module). Fixes <ulink url='&lfs-ticket-root;5290'>#5290</ulink>.
el: [bdubbs] - Ενημέρωση του wheel-0.41.0 (Python Module). Διορθώσεις <ulink url='&lfs-ticket-root;5290'>#5290</ulink>.

source: [bdubbs] - Update to tar-1.35. Fixes <ulink url='&lfs-ticket-root;5287'>#5287</ulink>.
el: [bdubbs] - Ενημέρωση του tar-1.35. Διορθώσεις <ulink url='&lfs-ticket-root;5287'>#5287</ulink>.

source: [bdubbs] - Update to<phrase revision='sysv'> udev from</phrase> systemd-254. Fixes <ulink url='&lfs-ticket-root;5293'>#5293</ulink>.
el: [bdubbs] - Ενημέρωση του <phrase revision='sysv'> udev from</phrase> systemd-254. Διορθώσεις <ulink url='&lfs-ticket-root;5293'>#5293</ulink>.

source: [bdubbs] - Update to meson-1.2.0. Fixes <ulink url='&lfs-ticket-root;5286'>#5286</ulink>.
el: [bdubbs] - Ενημέρωση του meson-1.2.0. Διορθώσεις <ulink url='&lfs-ticket-root;5286'>#5286</ulink>.

source: [bdubbs] - Update to linux-6.4.7. Fixes <ulink url='&lfs-ticket-root;5288'>#5288</ulink>.
el: [bdubbs] - Ενημέρωση του linux-6.4.7. Διορθώσεις <ulink url='&lfs-ticket-root;5288'>#5288</ulink>.

source: [bdubbs] - Update to gcc-13.2.0. Fixes <ulink url='&lfs-ticket-root;5292'>#5292</ulink>.
el: [bdubbs] - Ενημέρωση του gcc-13.2.0. Διορθώσεις <ulink url='&lfs-ticket-root;5292'>#5292</ulink>.

source: [bdubbs] - Update to file-5.45. Fixes <ulink url='&lfs-ticket-root;5294'>#5294</ulink>.
el: [bdubbs] - Ενημέρωση του file-5.45. Διορθώσεις <ulink url='&lfs-ticket-root;5294'>#5294</ulink>.

source: [xry111] - Enable cgroup-based memory pressure information in kernel, and add the cgroup file system into /etc/fstab and the mountvirtfs bootscript. This is a preparation for udev from systemd-254. Addresses <ulink url='&lfs-ticket-root;5293'>#5293</ulink>.
el: [xry111] - Ενεργοποιήθηκαν οι πληροφορίες πίεσης μνήμης βασισμένες σε cgroup στον πυρήνα και προστέθηκε το σύστημα αρχείων cgroup στο /etc/fstab και στο mountvirtfs bootscript. Αυτή είναι μια προετοιμασία για το udev από το systemd-254. Αναφορές<ulink url='&lfs-ticket-root;5293'>#5293</ulink>.

source: [xry111] - Make the mountvirtfs bootscript create essential symlinks in /dev. Fixes <ulink url='&lfs-ticket-root;5289'>#5289</ulink>.
el: [xry111] - Προστέθηκε στο bootscript mountvirtfs η δημιουργία απαραίτητων συμβολικών συνδέσεων στον κατάλογο /dev. Διορθώσεις <ulink url='&lfs-ticket-root;5289'>#5289</ulink>.

source: [xry111] - Replace eudev-3.2.12 with udev from systemd-253. Fixes <ulink url='&lfs-ticket-root;5285'>#5085</ulink>.
el: [xry111] - Αντικαταστάθηκε το eudev-3.2.12 με το udev από το systemd-253. Διορθώσεις <ulink url='&lfs-ticket-root;5285'>#5085</ulink>.

source: [bdubbs] - Update to iana-etc-20230629. Addresses <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
el: [bdubbs] - Ενημερώθηκε το iana-etc-20230629. Αναφορές <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.

source: [bdubbs] - Update to linux-6.4.3. Fixes <ulink url='&lfs-ticket-root;5284'>#5284</ulink>.
el: [bdubbs] - Ενημερώθηκε το linux-6.4.3. Διορθώσεις <ulink url='&lfs-ticket-root;5284'>#5284</ulink>.

source: [bdubbs] - Update to libxcrypt-4.4.36. Fixes <ulink url='&lfs-ticket-root;5283'>#5283</ulink>.
el: [bdubbs] - Ενημερώθηκε το libxcrypt-4.4.36. Διορθώσεις <ulink url='&lfs-ticket-root;5283'>#5283</ulink>.

source: [bdubbs] - Update to groff-1.23.0. Fixes <ulink url='&lfs-ticket-root;5282'>#5282</ulink>.
el: [bdubbs] - Ενημερώθηκε το groff-1.23.0. Διορθώσεις <ulink url='&lfs-ticket-root;5282'>#5282</ulink>.

source: [bdubbs] - Update to perl-5.38.0. Fixes <ulink url='&lfs-ticket-root;5281'>#5281</ulink>.
el: [bdubbs] - Ενημερώθηκε το perl-5.38.0. Διορθώσεις <ulink url='&lfs-ticket-root;5281'>#5281</ulink>.

source: [xry111] - Add libxcrypt-4.4.35. Fixes <ulink url='&lfs-ticket-root;5280'>#5280</ulink>.
el: [xry111] - Προστέθηκε το libxcrypt-4.4.35. Διορθώσεις <ulink url='&lfs-ticket-root;5280'>#5280</ulink>.

source: [xry111] - Update to iproute2-6.4.0. Fixes <ulink url='&lfs-ticket-root;5277'>#5277</ulink>.
el: [xry111] - Ενημερώθηκε το iproute2-6.4.0. Διορθώσεις <ulink url='&lfs-ticket-root;5277'>#5277</ulink>.

source: [xry111] - Update to linux-6.4.1. Fixes <ulink url='&lfs-ticket-root;5276'>#5276</ulink>.
el: [xry111] - Ενημερώθηκε το linux-6.4.1. Διορθώσεις <ulink url='&lfs-ticket-root;5276'>#5276</ulink>.

source: [bdubbs] - Update to iana-etc-20230615. Addresses <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
el: [bdubbs] - Ενημερώθηκε το iana-etc-20230615. Αναφορές <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.

source: [bdubbs] - Update to vim-9.0.1671. Addresses <ulink url='&lfs-ticket-root;4500'>#4500</ulink>.
el: [bdubbs] - Ενημερώθηκε το vim-9.0.1671. Αναφορές <ulink url='&lfs-ticket-root;4500'>#4500</ulink>.

source: [bdubbs] - Update to util-linux-2.39.1. Addresses <ulink url='&lfs-ticket-root;5278'>#5278</ulink>.
el: [bdubbs] - Ενημερώθηκε το util-linux-2.39.1. Αναφορές <ulink url='&lfs-ticket-root;5278'>#5278</ulink>.

source: [bdubbs] - Update to linux-6.3.10. Addresses <ulink url='&lfs-ticket-root;5276'>#5276</ulink>.
el: [bdubbs] - Ενημερώθηκε το linux-6.3.10. Αναφορές <ulink url='&lfs-ticket-root;5276'>#5276</ulink>.

source: [rahul] - Update to kbd-2.6.1. Fixes <ulink url='&lfs-ticket-root;5279'>#5279</ulink>.
el: [rahul] - Ενημερώθηκε το kbd-2.6.1. Διορθώσεις <ulink url='&lfs-ticket-root;5279'>#5279</ulink>.

source: [bdubbs] - Update to gettext-0.22. Fixes <ulink url='&lfs-ticket-root;5275'>#5275</ulink>.
el: [bdubbs] - Ενημερώθηκε το gettext-0.22. Διορθώσεις <ulink url='&lfs-ticket-root;5275'>#5275</ulink>.

source: [xry111] - Update to linux-6.3.8. Fixes <ulink url='&lfs-ticket-root;5272'>#5272</ulink>.
el: [xry111] - Ενημερώθηκε το linux-6.3.8. Διορθώσεις <ulink url='&lfs-ticket-root;5272'>#5272</ulink>.

source: [xry111] - Update to kbd-2.6.0. Fixes <ulink url='&lfs-ticket-root;5273'>#5273</ulink>.
el: [xry111] - Ενημερώθηκε το kbd-2.6.0. Διορθώσεις <ulink url='&lfs-ticket-root;5273'>#5273</ulink>.

source: [rahul] - Changed from pkg-config to pkgconf-1.9.5. Fixes <ulink url='&lfs-ticket-root;5274'>#5274</ulink>.
el: [rahul] - Έγινε αλλαγή από το pkg-config στο pkgconf-1.9.5. Διορθώσεις <ulink url='&lfs-ticket-root;5274'>#5274</ulink>.

source: [bdubbs] - Update to dbus-1.14.8. Fixes <ulink url='&lfs-ticket-root;5271'>#5271</ulink>.
el: [bdubbs] - Ενημερώθηκε το dbus-1.14.8. Διορθώσεις <ulink url='&lfs-ticket-root;5271'>#5271</ulink>.

source: [bdubbs] - Update to linux-6.3.6. Fixes <ulink url='&lfs-ticket-root;5269'>#5269</ulink>.
el: [bdubbs] - Ενημερώθηκε το linux-6.3.6. Διορθώσεις <ulink url='&lfs-ticket-root;5269'>#5269</ulink>.

source: [bdubbs] - Update to Python-3.11.4. Fixes <ulink url='&lfs-ticket-root;5271'>#5271</ulink>.
el: [bdubbs] - Ενημερώθηκε το Python-3.11.4. Διορθώσεις <ulink url='&lfs-ticket-root;5271'>#5271</ulink>.

source: [bdubbs] - Update to iana-etc-20230524. Addresses <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
el: [bdubbs] - Ενημερώθηκε το iana-etc-20230524. Αναφορές <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.

source: [bdubbs] - Update to MarkupSafe-2.1.3 (Python Module). Fixes <ulink url='&lfs-ticket-root;5268'>#5268</ulink>.
el: [bdubbs] - Ενημερώθηκε το MarkupSafe-2.1.3 (Python Module). Διορθώσεις <ulink url='&lfs-ticket-root;5268'>#5268</ulink>.

source: [bdubbs] - Update to linux-6.3.5. Fixes <ulink url='&lfs-ticket-root;5264'>#5264</ulink>.
el: [bdubbs] - Ενημερώθηκε το linux-6.3.5. Διορθώσεις <ulink url='&lfs-ticket-root;5264'>#5264</ulink>.

source: [bdubbs] - Update to openssl-3.1.1. Fixes <ulink url='&lfs-ticket-root;5267'>#5267</ulink>.
el: [bdubbs] - Ενημερώθηκε το openssl-3.1.1. Διορθώσεις <ulink url='&lfs-ticket-root;5267'>#5267</ulink>.

source: [bdubbs] - Update to meson-1.1.1. Fixes <ulink url='&lfs-ticket-root;5266'>#5266</ulink>.
el: [bdubbs] - Ενημερώθηκε το meson-1.1.1. Διορθώσεις <ulink url='&lfs-ticket-root;5266'>#5266</ulink>.

source: [bdubbs] - Update to diffutils-3.10. Fixes <ulink url='&lfs-ticket-root;5262'>#5262</ulink>.
el: [bdubbs] - Ενημερώθηκε το diffutils-3.10. Διορθώσεις <ulink url='&lfs-ticket-root;5262'>#5262</ulink>.

source: [bdubbs] - Update to bc-6.6.0. Fixes <ulink url='&lfs-ticket-root;5263'>#5263</ulink>.
el: [bdubbs] - Ενημερώθηκε το bc-6.6.0. Διορθώσεις <ulink url='&lfs-ticket-root;5263'>#5263</ulink>.

source: [ken] - Remove unneeded group sgx from eudev rules. Fixes <ulink url='&lfs-ticket-root;5265'>#5265</ulink>.
el: [ken] - Αφαιρέθηκε η αχρείαστη ομάδα sgx από τους κανόνες eudev. Διορθώσεις <ulink url='&lfs-ticket-root;5265'>#5265</ulink>.

source: [bdubbs] - Update to util-linux-2.39. Fixes <ulink url='&lfs-ticket-root;5259'>#5259</ulink>.
el: [bdubbs] - Ενημερώθηκε το util-linux-2.39. Διορθώσεις <ulink url='&lfs-ticket-root;5259'>#5259</ulink>.

source: [bdubbs] - Update to linux-6.3.3. Fixes <ulink url='&lfs-ticket-root;5261'>#5261</ulink>.
el: [bdubbs] - Ενημερώθηκε το linux-6.3.3. Διορθώσεις <ulink url='&lfs-ticket-root;5261'>#5261</ulink>.

source: [bdubbs] - Update to libcap-2.69. Fixes <ulink url='&lfs-ticket-root;5258'>#5258</ulink>.
el: [bdubbs] - Ενημερώθηκε το libcap-2.69. Διορθώσεις <ulink url='&lfs-ticket-root;5258'>#5258</ulink>.

source: [bdubbs] - Update to grep-3.11. Fixes <ulink url='&lfs-ticket-root;5256'>#5256</ulink>.
el: [bdubbs] - Ενημερώθηκε το grep-3.11. Διορθώσεις <ulink url='&lfs-ticket-root;5256'>#5256</ulink>.

source: [bdubbs] - Update to flit_core-3.9.0. Fixes <ulink url='&lfs-ticket-root;5257'>#5257</ulink>.
el: [bdubbs] - Ενημερώθηκε το flit_core-3.9.0. Διορθώσεις <ulink url='&lfs-ticket-root;5257'>#5257</ulink>.

source: [bdubbs] - Update to eudev-3.2.12. Fixes <ulink url='&lfs-ticket-root;5260'>#5260</ulink>.
el: [bdubbs] - Ενημερώθηκε το eudev-3.2.12. Διορθώσεις <ulink url='&lfs-ticket-root;5260'>#5260</ulink>.

source: [xry111] - Update to less-633. Fixes <ulink url='&lfs-ticket-root;5251'>#5251</ulink>.
el: [xry111] - Ενημερώθηκε το less-633. Διορθώσεις <ulink url='&lfs-ticket-root;5251'>#5251</ulink>.

source: [xry111] - Update to linux-6.3.2. Fixes <ulink url='&lfs-ticket-root;5255'>#5255</ulink>.
el: [xry111] - Ενημερώθηκε το linux-6.3.2. Διορθώσεις <ulink url='&lfs-ticket-root;5255'>#5255</ulink>.

source: [xry111] - Update to xz-5.4.3. Fixes <ulink url='&lfs-ticket-root;5252'>#5252</ulink>.
el: [xry111] - Ενημερώθηκε το xz-5.4.3. Διορθώσεις <ulink url='&lfs-ticket-root;5252'>#5252</ulink>.

source: [xry111] - Update to gawk-5.2.2. Fixes <ulink url='&lfs-ticket-root;5253'>#5253</ulink>.
el: [xry111] - Ενημερώθηκε το gawk-5.2.2. Διορθώσεις <ulink url='&lfs-ticket-root;5253'>#5253</ulink>.

source: [xry111] - Fix systemd runtime issue exploited by GCC 13. Fixes <ulink url='&lfs-ticket-root;5254'>#5254</ulink>.
el: [xry111] - Διορθώθηκε ένα πρόβλημα εκκίνησης του systemd εκμεταλλευόμενο από το GCC 13. Διορθώσεις <ulink url='&lfs-ticket-root;5254'>#5254</ulink>.

source: [bdubbs] - Update to vim-9.0.1503. Addresses <ulink url='&lfs-ticket-root;4500'>#4500</ulink>.
el: [bdubbs] - Ενημερώθηκε το vim-9.0.1503. Αναφορές <ulink url='&lfs-ticket-root;4500'>#4500</ulink>.

source: [bdubbs] - Update to iana-etc-20230418. Addresses <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
el: [bdubbs] - Ενημερώθηκε το iana-etc-20230418. Αναφορές <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.

source: [bdubbs] - Update to sysvinit-3.07. Fixes <ulink url='&lfs-ticket-root;5250'>#5250</ulink>.
el: [bdubbs] - Ενημερώθηκε το sysvinit-3.07. Διορθώσεις <ulink url='&lfs-ticket-root;5250'>#5250</ulink>.

source: [bdubbs] - Update to iproute2-6.3.0. Fixes <ulink url='&lfs-ticket-root;5248'>#5248</ulink>.
el: [bdubbs] - Ενημερώθηκε το iproute2-6.3.0. Διορθώσεις <ulink url='&lfs-ticket-root;5248'>#5248</ulink>.

source: [bdubbs] - Update to gcc-13.1.0. Fixes <ulink url='&lfs-ticket-root;5247'>#5247</ulink>.
el: [bdubbs] - Ενημερώθηκε το gcc-13.1.0. Διορθώσεις <ulink url='&lfs-ticket-root;5247'>#5247</ulink>.

source: [bdubbs] - Update to perl-5.36.1. Fixes <ulink url='&lfs-ticket-root;5246'>#5246</ulink>.
el: [bdubbs] - Ενημερώθηκε το perl-5.36.1. Διορθώσεις <ulink url='&lfs-ticket-root;5246'>#5246</ulink>.

source: [bdubbs] - Update to linux-6.3.1. Fixes <ulink url='&lfs-ticket-root;5245'>#5245</ulink>.
el: [bdubbs] - Ενημερώθηκε το linux-6.3.1. Διορθώσεις <ulink url='&lfs-ticket-root;5245'>#5245</ulink>.

source: [bdubbs] - Update to coreutils-9.3. Fixes <ulink url='&lfs-ticket-root;5244'>#5244</ulink>.
el: [bdubbs] - Ενημερώθηκε το coreutils-9.3. Διορθώσεις <ulink url='&lfs-ticket-root;5244'>#5244</ulink>.

source: [bdubbs] - Update to vim-9.0.1452. Addresses <ulink url='&lfs-ticket-root;4500'>#4500</ulink>.
el: [bdubbs] - Ενημερώθηκε το vim-9.0.1452. Αναφορές <ulink url='&lfs-ticket-root;4500'>#4500</ulink>.

source: [bdubbs] - Update to iana-etc-20230405. Addresses <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
el: [bdubbs] - Ενημερώθηκε το iana-etc-20230405. Αναφορές <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.

source: [bdubbs] - Update to zstd-1.5.5. Fixes <ulink url='&lfs-ticket-root;5239'>#5239</ulink>.
el: [bdubbs] - Ενημερώθηκε το zstd-1.5.5. Διορθώσεις <ulink url='&lfs-ticket-root;5239'>#5239</ulink>.

source: [bdubbs] - Update to Python-3.11.3. Fixes <ulink url='&lfs-ticket-root;5240'>#5240</ulink>.
el: [bdubbs] - Ενημερώθηκε το Python-3.11.3. Διορθώσεις <ulink url='&lfs-ticket-root;5240'>#5240</ulink>.

source: [bdubbs] - Update to meson-1.1.0. Fixes <ulink url='&lfs-ticket-root;5242'>#5242</ulink>.
el: [bdubbs] - Ενημερώθηκε το meson-1.1.0. Διορθώσεις <ulink url='&lfs-ticket-root;5242'>#5242</ulink>.

source: [bdubbs] - Update to man-pages-6.04. Fixes <ulink url='&lfs-ticket-root;5238'>#5238</ulink>.
el: [bdubbs] - Ενημερώθηκε το man-pages-6.04. Διορθώσεις <ulink url='&lfs-ticket-root;5238'>#5238</ulink>.

source: [bdubbs] - Update to linux-6.2.11. Fixes <ulink url='&lfs-ticket-root;5241'>#5241</ulink>.
el: [bdubbs] - Ενημερώθηκε το linux-6.2.11. Διορθώσεις <ulink url='&lfs-ticket-root;5241'>#5241</ulink>.

source: [xry111] - Update to linux-6.2.9 (security fix). Fixes <ulink url='&lfs-ticket-root;5230'>#5230</ulink>.
el: [xry111] - Ενημερώθηκε το linux-6.2.9 (διόρθωση ασφαλείας). Διορθώσεις <ulink url='&lfs-ticket-root;5230'>#5230</ulink>.

source: [xry111] - Update to grep-3.10. Fixes <ulink url='&lfs-ticket-root;5234'>#5234</ulink>.
el: [xry111] - Ενημερώθηκε το grep-3.10. Διορθώσεις <ulink url='&lfs-ticket-root;5234'>#5234</ulink>.

source: [xry111] - Update to wheel-0.40.0. Fixes <ulink url='&lfs-ticket-root;5229'>#5229</ulink>.
el: [xry111] - Ενημερώθηκε το wheel-0.40.0. Διορθώσεις <ulink url='&lfs-ticket-root;5229'>#5229</ulink>.

source: [xry111] - Update to bc-6.5.0. Fixes <ulink url='&lfs-ticket-root;5228'>#5228</ulink>.
el: [xry111] - Ενημερώθηκε το bc-6.5.0. Διορθώσεις <ulink url='&lfs-ticket-root;5228'>#5228</ulink>.

source: [xry111] - Update to texinfo-7.0.3. Fixes <ulink url='&lfs-ticket-root;5235'>#5235</ulink>.
el: [xry111] - Ενημερώθηκε το texinfo-7.0.3. Διορθώσεις <ulink url='&lfs-ticket-root;5235'>#5235</ulink>.

source: [xry111] - Update to coreutils-9.2. Fixes <ulink url='&lfs-ticket-root;5232'>#5232</ulink>.
el: [xry111] - Ενημερώθηκε το coreutils-9.2. Διορθώσεις <ulink url='&lfs-ticket-root;5232'>#5232</ulink>.

source: [xry111] - Update to libcap-2.68. Fixes <ulink url='&lfs-ticket-root;5236'>#5236</ulink>.
el: [xry111] - Ενημερώθηκε το libcap-2.68. Διορθώσεις <ulink url='&lfs-ticket-root;5236'>#5236</ulink>.

source: [xry111] - Update to tzdata-2023c. Fixes <ulink url='&lfs-ticket-root;5237'>#5237</ulink>.
el: [xry111] - Ενημερώθηκε το tzdata-2023c. Διορθώσεις <ulink url='&lfs-ticket-root;5237'>#5237</ulink>.

source: [xry111] - Update to xz-5.4.2. Fixes <ulink url='&lfs-ticket-root;5233'>#5233</ulink>.
el: [xry111] - Ενημερώθηκε το xz-5.4.2. Διορθώσεις <ulink url='&lfs-ticket-root;5233'>#5233</ulink>.

source: [xry111] - Update to openssl-3.1.0. Fixes <ulink url='&lfs-ticket-root;5227'>#5227</ulink>.
el: [xry111] - Ενημερώθηκε το openssl-3.1.0. Διορθώσεις <ulink url='&lfs-ticket-root;5227'>#5227</ulink>.

source: [xry111] - Add flit-core-3.8.0.
el: [xry111] - Προστέθηκε το flit-core-3.8.0.

source: [bdubbs] - Update to bc-6.4.0. Fixes <ulink url='&lfs-ticket-root;5217'>#5217</ulink>.
el: [bdubbs] - Ενημερώθηκε το bc-6.4.0. Διορθώσεις <ulink url='&lfs-ticket-root;5217'>#5217</ulink>.

source: [bdubbs] - Update to grep-3.9. Fixes <ulink url='&lfs-ticket-root;5225'>#5225</ulink>.
el: [bdubbs] - Ενημερώθηκε το grep-3.9. Διορθώσεις <ulink url='&lfs-ticket-root;5225'>#5225</ulink>.

source: [bdubbs] - Update to linux-6.2.6. Fixes <ulink url='&lfs-ticket-root;5226'>#5226</ulink>.
el: [bdubbs] - Ενημερώθηκε το linux-6.2.6. Διορθώσεις <ulink url='&lfs-ticket-root;5226'>#5226</ulink>.

source: [bdubbs] - Update to iana-etc-20230306. Addresses <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
el: [bdubbs] - Ενημερώθηκε το iana-etc-20230306. Αναφορές <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.

source: [xry111] - Update to systemd-253. Fixes <ulink url='&lfs-ticket-root;5206'>#5206</ulink>.
el: [xry111] - Ενημερώθηκε το systemd-253. Διορθώσεις <ulink url='&lfs-ticket-root;5206'>#5206</ulink>.

source: [xry111] - Update to bc-6.3.1. Fixes <ulink url='&lfs-ticket-root;5217'>#5217</ulink>.
el: [xry111] - Ενημερώθηκε το bc-6.3.1. Διορθώσεις <ulink url='&lfs-ticket-root;5217'>#5217</ulink>.

source: [xry111] - Update to linux-6.2.2 (security fixes). Fixes <ulink url='&lfs-ticket-root;5218'>#5218</ulink>.
el: [xry111] - Ενημερώθηκε το linux-6.2.2 (διορθώσεις ασφαλείας). Διορθώσεις <ulink url='&lfs-ticket-root;5218'>#5218</ulink>.

source: [xry111] - Update to procps-ng-4.0.3. Fixes <ulink url='&lfs-ticket-root;5220'>#5220</ulink>.
el: [xry111] - Ενημερώθηκε το procps-ng-4.0.3. Διορθώσεις <ulink url='&lfs-ticket-root;5220'>#5220</ulink>.

source: [xry111] - Update to iproute2-6.2.0. Fixes <ulink url='&lfs-ticket-root;5221'>#5221</ulink>.
el: [xry111] - Ενημερώθηκε το iproute2-6.2.0. Διορθώσεις <ulink url='&lfs-ticket-root;5221'>#5221</ulink>.

source: [xry111] - Update to meson-1.0.1. Fixes <ulink url='&lfs-ticket-root;5222'>#5222</ulink>.
el: [xry111] - Ενημερώθηκε το meson-1.0.1. Διορθώσεις <ulink url='&lfs-ticket-root;5222'>#5222</ulink>.

source: [xry111] - Update to make-4.4.1. Fixes <ulink url='&lfs-ticket-root;5223'>#5223</ulink>.
el: [xry111] - Ενημερώθηκε το make-4.4.1. Διορθώσεις <ulink url='&lfs-ticket-root;5223'>#5223</ulink>.
