Repository: Greekforce1821/el-LFS
Catalog: */chapter01/changelog.po
Languages: el

source: [xry111] - Update to libelf-0.189. Fixes <ulink url='&lfs-ticket-root;5224'>#5224</ulink>.
el: [xry111] - Ενημερώθηκε το libelf-0.189. Διορθώσεις <ulink url='&lfs-ticket-root;5224'>#5224</ulink>.

source: [bdubbs] - Change to a better host requirements script in Chapter 2.
el: [bdubbs] - Άλλαξε σε ένα καλύτερο σενάριο απαιτήσεων του κεντρικού υπολογιστή στο Κεφάλαιο 2.

source: [bdubbs] - LFS-11.3 released.
el: [bdubbs] - Κυκλοφόρησε το LFS-11.3.
