Repository: Greekforce1821/el-LFS
Catalog: */chapter01/how.po
Languages: el

source: How to Build an LFS System
el: Πως να κατασκευάσετε ένα LFS Σύστημα

source: The LFS system will be built by using an already installed Linux distribution (such as Debian, OpenMandriva, Fedora, or openSUSE). This existing Linux system (the host) will be used as a starting point to provide necessary programs, including a compiler, linker, and shell, to build the new system. Select the <quote>development</quote> option during the distribution installation to include these tools.
el: Το σύστημα LFS θα χτιστεί χρησιμοποιώντας μια ήδη εγκατεστημένη διανομή Linux (όπως Debian, OpenMandriva, Fedora ή openSUSE). Αυτό το υπάρχον σύστημα Linux (ο υποδοχέας) θα χρησιμοποιηθεί ως αφετηρία για την παροχή των απαραίτητων προγραμμάτων, συμπεριλαμβανομένου ενός μεταγλωττιστή, συνδέτη και shell, για την κατασκευή του νέου συστήματος. Επιλέξτε την επιλογή <quote>ανάπτυξη</quote> κατά την εγκατάσταση της διανομής για να περιλάβετε αυτά τα εργαλεία.

source: There are many ways to install a Linux distribution and the defaults are usually not optimal for building an LFS system. For suggestions on setting up a commercial distribution see: <ulink url="&lfs-root;hints/downloads/files/partitioning-for-lfs.txt"/>.
el: Υπάρχουν πολλοί τρόποι για την εγκατάσταση μιας διανομής Linux, και οι προεπιλεγμένες ρυθμίσεις συνήθως δεν είναι βέλτιστες για τη δημιουργία ενός συστήματος LFS. Για προτάσεις σχετικά με τη διαμόρφωση μιας εμπορικής διανομής, δείτε: <ulink url="&lfs-root;hints/downloads/files/partitioning-for-lfs.txt"/>.

source: As an alternative to installing a separate distribution on your machine, you may wish to use a LiveCD from a commercial distribution.
el: Ως εναλλακτική λύση για την εγκατάσταση μιας ξεχωριστής διανομής στον υπολογιστή σας, μπορείτε να χρησιμοποιήσετε ένα LiveCD από μια εμπορική διανομή.

source: <xref linkend="chapter-partitioning"/> of this book describes how to create a new Linux native partition and file system, where the new LFS system will be compiled and installed. <xref linkend="chapter-getting-materials"/> explains which packages and patches must be downloaded to build an LFS system, and how to store them on the new file system. <xref linkend="chapter-final-preps"/> discusses the setup of an appropriate working environment. Please read <xref linkend="chapter-final-preps"/> carefully as it explains several important issues you should be aware of before you begin to work your way through <xref linkend="chapter-cross-tools"/> and beyond.
el: Το <xref linkend="chapter-partitioning"/> αυτού του βιβλίου περιγράφει πώς να δημιουργήσετε ένα νέο Linux native διαμέρισμα και το αρχείο συστήματος αρχείων, όπου θα συνταχθεί και θα εγκατασταθεί το νέο σύστημα LFS. Το <xref linkend="chapter-getting-materials"/> εξηγεί ποια πακέτα και διορθώσεις πρέπει να ληφθούν για την κατασκευή ενός συστήματος LFS και πώς να τα αποθηκεύσετε στο νέο αρχείο συστήματος. Το <xref linkend="chapter-final-preps"/> αναφέρεται στη διάταξη ενός κατάλληλου περιβάλλοντος εργασίας. Παρακαλούμε διαβάστε προσεκτικά το <xref linkend="chapter-final-preps"/>, καθώς εξηγεί αρκετά σημαντικά θέματα που πρέπει να γνωρίζετε πριν αρχίσετε να προχωράτε στο <xref linkend="chapter-cross-tools"/> και πέραν αυτού.

source: <xref linkend="chapter-cross-tools"/> explains the installation of the initial tool chain, (binutils, gcc, and glibc) using cross-compilation techniques to isolate the new tools from the host system.
el: Το <xref linkend="chapter-cross-tools"/> εξηγεί την εγκατάσταση της αρχικής αλυσίδας εργαλείων (binutils, gcc και glibc) χρησιμοποιώντας τεχνικές διασταύρωσης (cross-compilation) για να απομονώσετε τα νέα εργαλεία από το σύστημα του υποδοχέα.

source: <xref linkend="chapter-temporary-tools"/> shows you how to cross-compile basic utilities using the just built cross-toolchain.
el: Το <xref linkend="chapter-temporary-tools"/> σας δείχνει πώς να διασταυρώσετε (cross-compile) βασικά βοηθητικά εργαλεία χρησιμοποιώντας την προσφάτως δημιουργημένη διασταυρωμένη αλυσίδα εργαλείων.

source: <xref linkend="chapter-chroot-temporary-tools"/> then enters a "chroot" environment, where we use the new tools to build all the rest of the tools needed to create the LFS system.
el: Στο <xref linkend="chapter-chroot-temporary-tools"/>, μπαίνετε σε ένα περιβάλλον "chroot", όπου χρησιμοποιείτε τα νέα εργαλεία για να κατασκευάσετε όλα τα υπόλοιπα εργαλεία που απαιτούνται για τη δημιουργία του συστήματος LFS.

source: This effort to isolate the new system from the host distribution may seem excessive. A full technical explanation as to why this is done is provided in <xref linkend="ch-tools-toolchaintechnotes"/>.
el: Αυτή η προσπάθεια απομόνωσης του νέου συστήματος από τη διανομή του υποδοχέα μπορεί να φαίνεται υπερβολική. Μια πλήρης τεχνική εξήγηση γιατί γίνεται αυτό παρέχεται στο <xref linkend="ch-tools-toolchaintechnotes"/>.

source: In <xref linkend="chapter-building-system"/> the full-blown LFS system is built. Another advantage provided by the chroot environment is that it allows you to continue using the host system while LFS is being built. While waiting for package compilations to complete, you can continue using your computer as usual.
el: Στο <xref linkend="chapter-building-system"/>, δημιουργείται το πλήρες σύστημα LFS. Ένα άλλο πλεονέκτημα που παρέχει το περιβάλλον "chroot" είναι ότι σας επιτρέπει να συνεχίσετε να χρησιμοποιείτε το σύστημα του υποδοχέα ενώ το LFS κατασκευάζεται. Κατά την αναμονή για την ολοκλήρωση των μεταγλωττίσεων των πακέτων, μπορείτε να συνεχίσετε να χρησιμοποιείτε τον υπολογιστή σας κανονικά.

source: To finish the installation, the basic system configuration is set up in <xref linkend="chapter-config"/>, and the kernel and boot loader are created in <xref linkend="chapter-bootable"/>. <xref linkend="chapter-finalizing"/> contains information on continuing the LFS experience beyond this book. After the steps in this chapter have been implemented, the computer is ready to boot into the new LFS system.
el: Για να ολοκληρωθεί η εγκατάσταση, η βασική διαμόρφωση του συστήματος πραγματοποιείτε στο <xref linkend="chapter-config"/>, και ο πυρήνας και ο φορτωτής εκκίνησης δημιουργούνται στο <xref linkend="chapter-bootable"/>. Το <xref linkend="chapter-finalizing"/> περιέχει πληροφορίες σχετικά με το πώς να συνεχίσετε την εμπειρία LFS πέραν αυτού του βιβλίου. Αφού ολοκληρωθούν οι ενέργειες σε αυτό το κεφάλαιο, ο υπολογιστής είναι έτοιμος να εκκινήσει στο νέο σύστημα LFS.

source: This is the process in a nutshell. Detailed information on each step is presented in the following chapters. Items that seem complicated now will be clarified, and everything will fall into place as you commence your LFS adventure.
el: Αυτή είναι η διαδικασία σε γενικές γραμμές. Λεπτομερείς πληροφορίες για κάθε βήμα παρουσιάζονται στα ακόλουθα κεφάλαια. Τα στοιχεία που φαίνονται περίπλοκα τώρα θα διασαφηνιστούν, και όλα θα τεθούν στη θέση τους καθώς θα αρχίσετε την περιπέτειά σας με το LFS.
