Repository: Greekforce1821/el-LFS
Catalog: */appendices/creat-comm.po
Languages: el

source: Creative Commons License
el: Άδεια Creative Commons

source: Creative Commons Legal Code
el: Νομικός Κώδικας της Creative Commons

source: Attribution-NonCommercial-ShareAlike 2.0
el: Αναφορά-Μη-Εμπορική-Κοινή Διανομή 2.0

source: CREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE LEGAL SERVICES. DISTRIBUTION OF THIS LICENSE DOES NOT CREATE AN ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS INFORMATION ON AN "AS-IS" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES REGARDING THE INFORMATION PROVIDED, AND DISCLAIMS LIABILITY FOR DAMAGES RESULTING FROM ITS USE.
el: Η CREATIVE COMMONS CORPORATION ΔΕΝ ΕΙΝΑΙ ΝΟΜΙΚΟ ΓΡΑΦΕΙΟ ΚΑΙ ΔΕΝ ΠΑΡΕΧΕΙ ΝΟΜΙΚΕΣ ΥΠΗΡΕΣΙΕΣ . Η ΔΙΑΝΟΜΗ ΑΥΤΗΣ ΤΗΣ ΑΔΕΙΑΣ ΔΕΝ ΔΗΜΙΟΥΡΓΕΙ ΜΙΑ ΣΧΕΣΗ ΔΙΚΗΓΟΡΟΥ-ΠΕΛΑΤΗ. Η CREATIVE COMMONS ΠΑΡΕΧΕΙ ΑΥΤΕΣ ΤΙΣ ΠΛΗΡΟΦΟΡΙΕΣ ΩΣ ΕΧΟΥΝ. Η CREATIVE COMMONS ΔΕΝ ΠΑΡΕΧΕΙ ΕΓΓΥΗΣΕΙΣ ΣΧΕΤΙΚΑ ΜΕ ΤΙς ΠΑΡΕΧΟΜΕΝΕΣ ΠΛΗΡΟΦΟΡΙΕΣ ΚΑΙ ΑΠΟΠΟΙΕΙΤΑΙ ΚΑΘΕ ΕΥΘΥΝΗ ΓΙΑ ΖΗΜΙΕΣ ΠΟΥ ΠΡΟΚΥΠΤΟΥΝ ΑΠΟ ΤΗΝ ΧΡΗΣΗ ΤΟΥΣ.

source: License
el: Άδεια

source: THE WORK (AS DEFINED BELOW) IS PROVIDED UNDER THE TERMS OF THIS CREATIVE COMMONS PUBLIC LICENSE ("CCPL" OR "LICENSE"). THE WORK IS PROTECTED BY COPYRIGHT AND/OR OTHER APPLICABLE LAW. ANY USE OF THE WORK OTHER THAN AS AUTHORIZED UNDER THIS LICENSE OR COPYRIGHT LAW IS PROHIBITED.
el: ΤΟ ΕΡΓΟ (ΟΠΩΣ ΟΡΙΖΕΤΑΙ ΠΑΡΑΚΑΤΩ) ΠΑΡΕΧΕΤΑΙ ΒΑΣΕΙ ΤΩΝ ΟΡΩΝ ΑΥΤΗΣ ΤΗΣ ΔΗΜΟΣΙΑΣ ΑΔΕΙΑΣ CREATIVE COMMONS ("CCPL" ή "ΑΔΕΙΑ"). ΤΟ ΕΡΓΟ ΠΡΟΣΤΑΤΕΥΕΤΑΙ ΑΠΟ ΤΟ ΠΝΕΥΜΑΤΙΚΟ ΔΙΚΑΙΟ ΚΑΙ/Η ΑΛΛΟΝ ΣΧΕΤΙΚΟ ΝΟΜΟ. ΟΠΟΙΑΔΗΠΟΤΕ ΧΡΗΣΗ ΤΟΥ ΕΡΓΟΥ ΠΕΡΑ ΑΠΟ ΑΥΤΗΝ ΠΟΥ ΕΠΙΤΡΕΠΕΤΑΙ ΒΑΣΕΙ ΑΥΤΗΣ ΤΗΣ ΑΔΕΙΑΣ Η ΤΟΥ ΠΝΕΥΜΑΤΙΚΟΥ ΔΙΚΑΙΟΥ ΑΠΑΓΟΡΕΥΕΤΑΙ.

source: BY EXERCISING ANY RIGHTS TO THE WORK PROVIDED HERE, YOU ACCEPT AND AGREE TO BE BOUND BY THE TERMS OF THIS LICENSE. THE LICENSOR GRANTS YOU THE RIGHTS CONTAINED HERE IN CONSIDERATION OF YOUR ACCEPTANCE OF SUCH TERMS AND CONDITIONS.
el: ΜΕ ΤΗΝ ΕΞΑΣΚΗΣΗ ΚΑΘΕ ΔΙΚΑΙΩΜΑΤΟΣ ΠΟΥ ΠΑΡΕΧΕΤΑΙ ΕΔΩ, ΣΥΜΦΩΝΕΙΤΕ ΚΑΙ ΑΠΟΔΕΧΕΣΤΕ ΝΑ ΥΠΟΚΕΙΣΤΕ ΚΑΙ ΝΑ ΣΥΝΑΣΠΙΣΤΕΙΤΕ ΣΤΟΥΣ ΟΡΟΥΣ ΑΥΤΗΣ ΤΗΣ ΑΔΕΙΑΣ. Ο ΑΔΕΙΟΧΗΡΩΤΗΣ ΣΑΣ ΠΑΡΕΧΕΙ ΤΑ ΔΙΚΑΙΩΜΑΤΑ ΠΟΥ ΠΕΡΙΕΧΟΝΤΑΙ ΕΔΩ ΣΕ ΑΝΤΑΛΛΑΓΗ ΓΙΑ ΤΗΝ ΑΠΟΔΟΧΗ ΣΑΣ ΤΩΝ ΣΥΓΚΕΚΡΙΜΕΝΩΝ ΟΡΩΝ ΚΑΙ ΠΡΟΫΠΟΘΕΣΕΩΝ.

source: Definitions
el: Ορισμοί

source: "Collective Work" means a work, such as a periodical issue, anthology or encyclopedia, in which the Work in its entirety in unmodified form, along with a number of other contributions, constituting separate and independent works in themselves, are assembled into a collective whole. A work that constitutes a Collective Work will not be considered a Derivative Work (as defined below) for the purposes of this License.
el: "Συλλογικό Έργο" σημαίνει ένα έργο, όπως ένα τεύχος περιοδικού, ανθολογία ή εγκυκλοπαίδεια, στο οποίο το Έργο σε όλο του το μέγεθος, σε μη τροποποιημένη μορφή, συνδυάζεται με αρκετές άλλες συνεισφορές, που αποτελούν ξεχωριστά και ανεξάρτητα έργα καθαυτά, και συντελούν στον σχηματισμό ενός συλλογικού συνόλου. Ένα έργο που αποτελεί Συλλογικό Έργο δε θα θεωρείται ένα Παράγωγο Έργο (όπως ορίζεται παρακάτω) για τους σκοπούς αυτής της Άδειας.

source: "Derivative Work" means a work based upon the Work or upon the Work and other pre-existing works, such as a translation, musical arrangement, dramatization, fictionalization, motion picture version, sound recording, art reproduction, abridgment, condensation, or any other form in which the Work may be recast, transformed, or adapted, except that a work that constitutes a Collective Work will not be considered a Derivative Work for the purpose of this License. For the avoidance of doubt, where the Work is a musical composition or sound recording, the synchronization of the Work in timed-relation with a moving image ("synching") will be considered a Derivative Work for the purpose of this License.
el: "Παράγωγο Έργο" σημαίνει ένα έργο που βασίζεται στο Έργο ή στο Έργο και σε άλλα υπάρχοντα έργα, όπως μια μετάφραση, μια μουσική ενορχήστρωση, μια δραματοποίηση, μια επαναφαντασίωση, μια κινηματογραφική εκδοχή, ηχογράφηση, αναπαραγωγή τέχνης, συντομογράφηση, περίληψη ή οποιαδήποτε άλλη μορφή με την οποία το Έργο μπορεί να αναδιαμορφωθεί, μετασχηματιστεί ή προσαρμοστεί, εκτός αν ένα έργο που αποτελεί Συλλογικό Έργο δε θα θεωρείται Παράγωγο Έργο για τον σκοπό αυτής της Άδειας. Για αποφυγή ασάφειας, όταν το Έργο είναι μια μουσική σύνθεση ή ηχογράφηση, η συγχρονισμός του Έργου με κινούμενη εικόνα ("συγχρονισμός") θα θεωρείται Παράγωγο Έργο για τον σκοπό αυτής της Άδειας.

source: "Licensor" means the individual or entity that offers the Work under the terms of this License.
el: "Διαχειριστής Άδειας" σημαίνει το άτομο ή το νομικό πρόσωπο που προσφέρει το Έργο βάσει των όρων αυτής της Άδειας.

source: "Original Author" means the individual or entity who created the Work.
el: "Αρχικός Δημιουργός" σημαίνει το άτομο ή το νομικό πρόσωπο που δημιούργησε το Έργο.

source: "Work" means the copyrightable work of authorship offered under the terms of this License.
el: "Έργο" σημαίνει το έργο πνευματικής ιδιοκτησίας που προσφέρεται βάσει των όρων αυτής της Άδειας.

source: "You" means an individual or entity exercising rights under this License who has not previously violated the terms of this License with respect to the Work, or who has received express permission from the Licensor to exercise rights under this License despite a previous violation.
el: "Εσείς" σημαίνει ένα άτομο ή νομικό πρόσωπο που ασκεί δικαιώματα βάσει αυτής της Άδειας και που δεν έχει παραβαίνει προηγουμένως τους όρους αυτής της Άδειας σχετικά με το Έργο, ή το οποίο έχει λάβει ρητή άδεια από τον Διαχειριστή Άδειας να ασκήσει δικαιώματα βάσει αυτής της Άδειας παρά την ύπαρξη προηγούμενης παραβίασης.

source: "License Elements" means the following high-level license attributes as selected by Licensor and indicated in the title of this License: Attribution, Noncommercial, ShareAlike.
el: "Στοιχεία Άδειας" σημαίνει τα ακόλουθα υψηλού επιπέδου χαρακτηριστικά άδειας που επιλέγονται από τον Διαχειριστή Άδειας και προσδιορίζονται στον τίτλο αυτής της Άδειας: Αναφορά, Μη Εμπορική Χρήση, Με την ίδια άδεια.

source: Fair Use Rights. Nothing in this license is intended to reduce, limit, or restrict any rights arising from fair use, first sale or other limitations on the exclusive rights of the copyright owner under copyright law or other applicable laws.
el: Δικαιώματα Δίκαιης Χρήσης. Τίποτα σε αυτήν την άδεια δεν έχει σκοπό να μειώσει, περιορίσει ή περιορίσει τα δικαιώματα που προκύπτουν από τη Δίκαιη Χρήση, την πρώτη πώληση ή άλλοι περιορισμοί στα αποκλειστικά δικαιώματα του κατόχου των πνευματικών δικαιωμάτων βάσει του περικείμενου του νόμου περί πνευματικής ιδιοκτησίας ή άλλων εφαρμοστέων νόμων.

source: License Grant. Subject to the terms and conditions of this License, Licensor hereby grants You a worldwide, royalty-free, non-exclusive, perpetual (for the duration of the applicable copyright) license to exercise the rights in the Work as stated below:
el: Παροχή Άδειας. Υπό τους όρους και τις προϋποθέσεις αυτής της Άδειας, ο Διαχειριστής Άδειας χορηγεί εδώ σε εσάς μια παγκόσμια, απαλλαγμένη από ρόγες, μη αποκλειστική, διαρκή (για τη διάρκεια των εφαρμοστέων πνευματικών δικαιωμάτων) άδεια για να ασκήσετε τα δικαιώματα στο Έργο όπως περιγράφονται παρακάτω:

source: to reproduce the Work, to incorporate the Work into one or more Collective Works, and to reproduce the Work as incorporated in the Collective Works;
el: για να αναπαράγετε το Έργο, να ενσωματώσετε το Έργο σε ένα ή περισσότερα Συλλογικά Έργα και να αναπαράγετε το Έργο όπως ενσωματώνεται στα Συλλογικά Έργα;

source: to create and reproduce Derivative Works;
el: για να δημιουργήσετε και να αναπαράγετε Παράγωγα Έργα;

source: to distribute copies or phonorecords of, display publicly, perform publicly, and perform publicly by means of a digital audio transmission the Work including as incorporated in Collective Works;
el: για να διανέμετε αντίγραφα ή φωνοηχογραφήσεις, να το εμφανίζετε δημόσια, να το εκτελείτε δημόσια και να το εκτελείτε δημόσια μέσω ψηφιακής ακουστικής μετάδοσης το Έργο, συμπεριλαμβανομένου όπως ενσωματώνεται σε Συλλογικά Έργα;

source: to distribute copies or phonorecords of, display publicly, perform publicly, and perform publicly by means of a digital audio transmission Derivative Works;
el: για να διανέμετε αντίγραφα ή φωνοηχογραφήσεις, να τα εμφανίζετε δημόσια, να τα εκτελείτε δημόσια και να τα εκτελείτε δημόσια μέσω ψηφιακής ακουστικής μετάδοσης Παράγωγων Έργων;

source: The above rights may be exercised in all media and formats whether now known or hereafter devised. The above rights include the right to make such modifications as are technically necessary to exercise the rights in other media and formats. All rights not expressly granted by Licensor are hereby reserved, including but not limited to the rights set forth in Sections 4(e) and 4(f).
el: Τα παραπάνω δικαιώματα μπορούν να ασκηθούν σε όλα τα μέσα και τις μορφές, είτε είναι προς το παρόν γνωστά είτε εφεξής αναπτυγμένα. Τα παραπάνω δικαιώματα περιλαμβάνουν το δικαίωμα να πραγματοποιούνται τροποποιήσεις που είναι τεχνικά απαραίτητες για την ασκηση των δικαιωμάτων σε άλλα μέσα και μορφές. Όλα τα δικαιώματα που δεν χορηγούνται ρητά από τον Διαχειριστή Άδειας επιφυλάσσονται, συμπεριλαμβανομένων, αλλά όχι περιοριστικά, των δικαιωμάτων που καθορίζονται στις Ενότητες 4(e) και 4(f).

source: Restrictions.The license granted in Section 3 above is expressly made subject to and limited by the following restrictions:
el: Περιορισμοί. Η άδεια που χορηγείται στην Ενότητα 3 παραπάνω υπόκειται ρητώς σε και περιορίζεται από τους παρακάτω περιορισμούς:

source: You may distribute, publicly display, publicly perform, or publicly digitally perform the Work only under the terms of this License, and You must include a copy of, or the Uniform Resource Identifier for, this License with every copy or phonorecord of the Work You distribute, publicly display, publicly perform, or publicly digitally perform. You may not offer or impose any terms on the Work that alter or restrict the terms of this License or the recipients' exercise of the rights granted hereunder. You may not sublicense the Work. You must keep intact all notices that refer to this License and to the disclaimer of warranties. You may not distribute, publicly display, publicly perform, or publicly digitally perform the Work with any technological measures that control access or use of the Work in a manner inconsistent with the terms of this License Agreement. The above applies to the Work as incorporated in a Collective Work, but this does not require the Collective Work apart from the Work itself to be made subject to the terms of this License. If You create a Collective Work, upon notice from any Licensor You must, to the extent practicable, remove from the Collective Work any reference to such Licensor or the Original Author, as requested. If You create a Derivative Work, upon notice from any Licensor You must, to the extent practicable, remove from the Derivative Work any reference to such Licensor or the Original Author, as requested.
el: Μπορείτε να διανέμετε, να εμφανίζετε δημόσια, να εκτελείτε δημόσια ή να εκτελείτε δημόσια μέσω ψηφιακής ακουστικής μετάδοσης το Έργο μόνο υπό τους όρους αυτής της Άδειας, και πρέπει να περιλαμβάνετε ένα αντίγραφο της παρούσας Άδειας ή το Ομοιόμορφο Αναγνωριστικό Πόρου (Uniform Resource Identifier - URI) γι' αυτήν με κάθε αντίγραφο ή φωνοηχογράφηση του Έργου που διανέμετε, εμφανίζετε δημόσια, εκτελείτε δημόσια ή εκτελείτε δημόσια μέσω ψηφιακής ακουστικής μετάδοσης. Δεν επιτρέπεται να προσφέρετε ή να επιβάλλετε οποιουδήποτε όρους στο Έργο που τροποποιούν ή περιορίζουν τους όρους αυτής της Άδειας ή την άσκηση των δικαιωμάτων που χορηγούνται στους παραλήπτες βάσει αυτής της Άδειας. Δεν επιτρέπεται η υπο-άδεια του Έργου. Πρέπει να διατηρείτε ανέπαφες όλες τις ειδοποιήσεις που αναφέρονται σε αυτήν την Άδεια και στην αποποίηση ευθυνών. Δεν επιτρέπεται να διανέμετε, να εμφανίζετε δημόσια, να εκτελείτε δημόσια ή να εκτελείτε δημόσια μέσω ψηφιακής ακουστικής μετάδοσης το Έργο με τη χρήση τεχνολογικών μέτρων που ελέγχουν την πρόσβαση ή τη χρήση του Έργου με τρόπο που είναι ασυμβίβαστος με τους όρους αυτής της Άδειας. Τα παραπάνω ισχύουν για το Έργο όπως ενσωματώνεται σε ένα Συλλογικό Έργο, αλλά αυτό δεν απαιτεί το Συλλογικό Έργο, εκτός από το Έργο καθαυτό, να υπόκειται στους όρους αυτής της Άδειας. Αν δημιουργήσετε ένα Συλλογικό Έργο, κατόπιν ειδοποίησης από κάθε Διαχειριστή Άδειας, πρέπει, όσο είναι εφικτό, να αφαιρέσετε από το Συλλογικό Έργο κάθε αναφορά σε αυτόν τον Διαχειριστή Άδειας ή τον Αρχικό Δημιουργό, όπως ζητηθεί. Αν δημιουργήσετε ένα Παράγωγο Έργο, κατόπιν ειδοποίησης από κάθε Διαχειριστή Άδειας, πρέπει, όσο είναι εφικτό, να αφαιρέσετε από το Παράγωγο Έργο κάθε αναφορά σε αυτόν τον Διαχειριστή Άδειας ή τον Αρχικό Δημιουργό, όπως ζητηθεί.

source: You may distribute, publicly display, publicly perform, or publicly digitally perform a Derivative Work only under the terms of this License, a later version of this License with the same License Elements as this License, or a Creative Commons iCommons license that contains the same License Elements as this License (e.g. Attribution-NonCommercial-ShareAlike 2.0 Japan). You must include a copy of, or the Uniform Resource Identifier for, this License or other license specified in the previous sentence with every copy or phonorecord of each Derivative Work You distribute, publicly display, publicly perform, or publicly digitally perform. You may not offer or impose any terms on the Derivative Works that alter or restrict the terms of this License or the recipients' exercise of the rights granted hereunder, and You must keep intact all notices that refer to this License and to the disclaimer of warranties. You may not distribute, publicly display, publicly perform, or publicly digitally perform the Derivative Work with any technological measures that control access or use of the Work in a manner inconsistent with the terms of this License Agreement. The above applies to the Derivative Work as incorporated in a Collective Work, but this does not require the Collective Work apart from the Derivative Work itself to be made subject to the terms of this License.
el: Μπορείτε να διανέμετε, να εμφανίζετε δημόσια, να εκτελείτε δημόσια ή να εκτελείτε δημόσια μέσω ψηφιακής ακουστικής μετάδοσης ένα Παράγωγο Έργο μόνο υπό τους όρους αυτής της Άδειας, μιας μεταγενέστερης έκδοσης αυτής της Άδειας με τα ίδια Στοιχεία Άδειας όπως αυτή η Άδεια, ή μιας άδειας Creative Commons iCommons που περιέχει τα ίδια Στοιχεία Άδειας όπως αυτή η Άδεια (π.χ. Attribution-NonCommercial-ShareAlike 2.0 Japan). Πρέπει να περιλαμβάνετε ένα αντίγραφο της παρούσας Άδειας ή άλλης άδειας που καθορίζεται στην προηγούμενη πρόταση, ή το Ομοιόμορφο Αναγνωριστικό Πόρου (URI), με κάθε αντίγραφο ή φωνοηχογράφηση κάθε Παραγώγου Έργου που διανέμετε, εμφανίζετε δημόσια, εκτελείτε δημόσια ή εκτελείτε δημόσια μέσω ψηφιακής ακουστικής μετάδοσης. Δεν επιτρέπεται να προσφέρετε ή να επιβάλλετε οποιουδήποτε όρους στα Παράγωγα Έργα που τροποποιούν ή περιορίζουν τους όρους αυτής της Άδειας ή την άσκηση των δικαιωμάτων που χορηγούνται στους παραλήπτες βάσει αυτής της Άδειας, και πρέπει να διατηρείτε ανέπαφες όλες τις ειδοποιήσεις που αναφέρονται σε αυτήν την Άδεια και στην αποποίηση ευθυνών. Δεν επιτρέπεται να διανέμετε, να εμφανίζετε δημόσια, να εκτελείτε δημόσια ή να εκτελείτε δημόσια μέσω ψηφιακής ακουστικής μετάδοσης το Παράγωγο Έργο με τη χρήση τεχνολογικών μέτρων που ελέγχουν την πρόσβαση ή τη χρήση του Έργου με τρόπο που είναι ασυμβίβαστος με τους όρους αυτής της Άδειας. Τα παραπάνω ισχύουν για το Παράγωγο Έργο όπως ενσωματώνεται σε ένα Συλλογικό Έργο, αλλά αυτό δεν απαιτεί το Συλλογικό Έργο, εκτός από το Παράγωγο Έργο καθαυτό, να υπόκειται στους όρους αυτής της Άδειας.

source: You may not exercise any of the rights granted to You in Section 3 above in any manner that is primarily intended for or directed toward commercial advantage or private monetary compensation. The exchange of the Work for other copyrighted works by means of digital file-sharing or otherwise shall not be considered to be intended for or directed toward commercial advantage or private monetary compensation, provided there is no payment of any monetary compensation in connection with the exchange of copyrighted works.
el: Δεν μπορείτε να ασκήσετε κανένα από τα δικαιώματα που σας χορηγούνται στην Ενότητα 3 παραπάνω με τρόπο που κυρίως επιδιώκει ή είναι κατευθυνόμενο προς εμπορικό όφελος ή ιδιωτική χρηματική αποζημίωση. Η ανταλλαγή του Έργου με άλλα πνευματικά δικαιώματα μέσω ψηφιακής ανταλλαγής αρχείων ή με άλλο τρόπο δεν θα θεωρηθεί ως που επιδιώκεται ή κατευθύνεται προς εμπορικό όφελος ή ιδιωτική χρηματική αποζημίωση, εφόσον δεν υπάρχει καμία πληρωμή χρηματικής αποζημίωσης σε σχέση με την ανταλλαγή πνευματικών δικαιωμάτων.

source: If you distribute, publicly display, publicly perform, or publicly digitally perform the Work or any Derivative Works or Collective Works, You must keep intact all copyright notices for the Work and give the Original Author credit reasonable to the medium or means You are utilizing by conveying the name (or pseudonym if applicable) of the Original Author if supplied; the title of the Work if supplied; to the extent reasonably practicable, the Uniform Resource Identifier, if any, that Licensor specifies to be associated with the Work, unless such URI does not refer to the copyright notice or licensing information for the Work; and in the case of a Derivative Work, a credit identifying the use of the Work in the Derivative Work (e.g., "French translation of the Work by Original Author," or "Screenplay based on original Work by Original Author"). Such credit may be implemented in any reasonable manner; provided, however, that in the case of a Derivative Work or Collective Work, at a minimum such credit will appear where any other comparable authorship credit appears and in a manner at least as prominent as such other comparable authorship credit.
el: Εάν διανέμετε, εμφανίζετε δημόσια, εκτελείτε δημόσια ή εκτελείτε δημόσια μέσω ψηφιακής ακουστικής μετάδοσης το Έργο ή οποιαδήποτε Παράγωγα Έργα ή Συλλογικά Έργα, πρέπει να διατηρείτε ανέπαφες όλες τις ειδοποιήσεις πνευματικών δικαιωμάτων για το Έργο και να δίνετε τα εύλογα απαιτούμενα αποδεικτικά στοιχεία στο μέσο ή τον τρόπο που χρησιμοποιείτε, αναφέροντας το όνομα (ή ψευδώνυμο, αν είναι εφαρμόσιμο) του Αρχικού Δημιουργού, εάν έχει παρασχεθεί· τον τίτλο του Έργου, εάν έχει παρασχεθεί· κατά το δυνατό, το Ομοιόμορφο Αναγνωριστικό Πόρου, εάν υπάρχει, που καθορίζεται από τον Διαχειριστή Άδειας για να συσχετίζεται με το Έργο, εκτός αν το URI αυτό δεν αναφέρεται στην ειδοποίηση πνευματικών δικαιωμάτων ή στις πληροφορίες άδειας για το Έργο· και στην περίπτωση ενός Παράγωγου Έργου, μια αναφορά που αναγνωρίζει τη χρήση του Έργου στο Παράγωγο Έργο (π.χ. "Μετάφραση στα γαλλικά του Έργου από τον Αρχικό Δημιουργό" ή "Σενάριο βασισμένο στο αρχικό Έργο του Αρχικού Δημιουργού"). Τέτοια αναφορά μπορεί να εφαρμοστεί με οποιονδήποτε λογικό τρόπο, υπό τον όρο, ωστόσο, ότι στην περίπτωση ενός Παράγωγου Έργου ή Συλλογικού Έργου, τουλάχιστον αυτή η αναφορά θα πρέπει να εμφανίζεται εκεί όπου εμφανίζεται οποιαδήποτε άλλη συγκρίσιμη αναφορά συγγραφής και με τρόπο τουλάχιστον τόσο έντονο όσο αυτή η άλλη συγκρίσιμη αναφορά συγγραφής.

source: For the avoidance of doubt, where the Work is a musical composition:
el: Για αποφυγή ασάφειας, όταν το Έργο είναι μια μουσική σύνθεση:

source: Performance Royalties Under Blanket Licenses. Licensor reserves the exclusive right to collect, whether individually or via a performance rights society (e.g. ASCAP, BMI, SESAC), royalties for the public performance or public digital performance (e.g. webcast) of the Work if that performance is primarily intended for or directed toward commercial advantage or private monetary compensation.
el: Δικαιώματα Εκτέλεσης με Άδειες Καλύμματος. Ο Διαχειριστής Άδειας διατηρεί το αποκλειστικό δικαίωμα να εισπράξει, είτε ατομικά είτε μέσω ενός συνδέσμου δικαιωμάτων εκτέλεσης (π.χ. ASCAP, BMI, SESAC), αποδοχές για τη δημόσια εκτέλεση ή τη δημόσια ψηφιακή εκτέλεση (π.χ. webcast) του Έργου, εάν αυτή η εκτέλεση είναι κυρίως προορισμένη για εμπορικό όφελος ή ιδιωτική χρηματική αποζημίωση.

source: Mechanical Rights and Statutory Royalties. Licensor reserves the exclusive right to collect, whether individually or via a music rights agency or designated agent (e.g. Harry Fox Agency), royalties for any phonorecord You create from the Work ("cover version") and distribute, subject to the compulsory license created by 17 USC Section 115 of the US Copyright Act (or the equivalent in other jurisdictions), if Your distribution of such cover version is primarily intended for or directed toward commercial advantage or private monetary compensation. 6. Webcasting Rights and Statutory Royalties. For the avoidance of doubt, where the Work is a sound recording, Licensor reserves the exclusive right to collect, whether individually or via a performance-rights society (e.g. SoundExchange), royalties for the public digital performance (e.g. webcast) of the Work, subject to the compulsory license created by 17 USC Section 114 of the US Copyright Act (or the equivalent in other jurisdictions), if Your public digital performance is primarily intended for or directed toward commercial advantage or private monetary compensation.
el: Μηχανικά Δικαιώματα και Κατανομή Στατιστικών Δικαιωμάτων. Ο Διαχειριστής Άδειας διατηρεί το αποκλειστικό δικαίωμα να εισπράξει, είτε ατομικά είτε μέσω ενός πρακτορείου μουσικών δικαιωμάτων ή καθορισμένου πράκτορα (π.χ. Harry Fox Agency), αποδοχές για οποιαδήποτε φωνοηχογράφηση δημιουργήσετε από το Έργο ("διασκευή") και διανέμετε, υπό την αναγκαστική άδεια που δημιουργείται από την ενότητα 115 του Αμερικανικού Νόμου περί Πνευματικών Δικαιωμάτων του 17 USC (ή το αντίστοιχο σε άλλες δικαιοδοσίες), εάν η διανομή σας αυτής της διασκευής έχει κυρίως ως στόχο το εμπορικό όφελος ή την ιδιωτική χρηματική αποζημίωση. Δικαιώματα Webcasting και Κατανομή Στατιστικών Δικαιωμάτων. Για αποφυγή ασάφειας, όταν το Έργο είναι ηχογράφηση, ο Διαχειριστής Άδειας διατηρεί το αποκλειστικό δικαίωμα να εισπράξει, είτε ατομικά είτε μέσω ενός συλλόγου δικαιωμάτων εκτέλεσης (π.χ. SoundExchange), αποδοχές για τη δημόσια ψηφιακή εκτέλεση (π.χ. webcast) του Έργου, υπό την αναγκαστική άδεια που δημιουργείται από την ενότητα 114 του Αμερικανικού Νόμου περί Πνευματικών Δικαιωμάτων του 17 USC (ή το αντίστοιχο σε άλλες δικαιοδοσίες), εάν η δημόσια ψηφιακή εκτέλεσή σας έχει κυρίως ως στόχο το εμπορικό όφελος ή την ιδιωτική χρηματική αποζημίωση.

source: Webcasting Rights and Statutory Royalties. For the avoidance of doubt, where the Work is a sound recording, Licensor reserves the exclusive right to collect, whether individually or via a performance-rights society (e.g. SoundExchange), royalties for the public digital performance (e.g. webcast) of the Work, subject to the compulsory license created by 17 USC Section 114 of the US Copyright Act (or the equivalent in other jurisdictions), if Your public digital performance is primarily intended for or directed toward commercial advantage or private monetary compensation.
el: Δικαιώματα Webcasting και Κατανομή Στατιστικών Δικαιωμάτων. Για αποφυγή ασάφειας, όταν το Έργο είναι ηχογράφηση, ο Διαχειριστής Άδειας διατηρεί το αποκλειστικό δικαίωμα να εισπράξει, είτε ατομικά είτε μέσω ενός συλλόγου δικαιωμάτων εκτέλεσης (π.χ. SoundExchange), αποδοχές για τη δημόσια ψηφιακή εκτέλεση (π.χ. webcast) του Έργου, υπό την αναγκαστική άδεια που δημιουργείται από την ενότητα 114 του Αμερικανικού Νόμου περί Πνευματικών Δικαιωμάτων του 17 USC (ή το αντίστοιχο σε άλλες δικαιοδοσίες), εάν η δημόσια ψηφιακή εκτέλεσή σας έχει κυρίως ως στόχο το εμπορικό όφελος ή την ιδιωτική χρηματική αποζημίωση.
