Repository: Greekforce1821/el-LFS
Catalog: */appendices/creat-comm.po
Languages: el

source: Representations, Warranties and Disclaimer
el: Δηλώσεις, Εγγυήσεις και Αποποίηση Ευθύνης

source: UNLESS OTHERWISE MUTUALLY AGREED TO BY THE PARTIES IN WRITING, LICENSOR OFFERS THE WORK AS-IS AND MAKES NO REPRESENTATIONS OR WARRANTIES OF ANY KIND CONCERNING THE WORK, EXPRESS, IMPLIED, STATUTORY OR OTHERWISE, INCLUDING, WITHOUT LIMITATION, WARRANTIES OF TITLE, MERCHANTIBILITY, FITNESS FOR A PARTICULAR PURPOSE, NONINFRINGEMENT, OR THE ABSENCE OF LATENT OR OTHER DEFECTS, ACCURACY, OR THE PRESENCE OF ABSENCE OF ERRORS, WHETHER OR NOT DISCOVERABLE. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF IMPLIED WARRANTIES, SO SUCH EXCLUSION MAY NOT APPLY TO YOU.
el: ΕΚΤΟΣ ΕΑΝ ΚΑΤΑ ΚΟΙΝΗ ΣΥΜΦΩΝΙΑ ΤΩΝ ΜΕΡΩΝ ΣΕ ΓΡΑΠΤΗ ΜΟΡΦΗ, Ο ΔΙΑΧΕΙΡΙΣΤΗΣ ΑΔΕΙΑΣ ΠΡΟΣΦΕΡΕΙ ΤΟ ΕΡΓΟ "ΩΣ ΕΧΕΙ" ΚΑΙ ΔΕΝ ΚΑΝΕΙ ΚΑΜΙΑ ΔΗΛΩΣΗ Ή ΕΓΓΥΗΣΗ ΟΠΟΙΟΥΔΗΠΟΤΕ ΕΙΔΟΥΣ ΣΧΕΤΙΚΑ ΜΕ ΤΟ ΕΡΓΟ, ΕΚΦΡΑΣΜΕΝΕΣ, ΥΠΟΝΟΟΥΜΕΝΕΣ, ΣΥΝΤΑΓΜΕΝΕΣ ΑΠΟ ΤΟΝ ΝΟΜΟ Ή ΑΛΛΙΩΣ, ΣΥΜΠΕΡΙΛΑΜΒΑΝΟΜΕΝΩΝ, ΧΩΡΙΣ ΠΕΡΙΟΡΙΣΜΟ, ΕΓΓΥΗΣΕΩΝ ΓΙΑ ΤΗΝ ΤΙΤΛΟΤΗΤΑ, ΤΗΝ ΕΜΠΟΡΕΥΣΙΜΟΤΗΤΑ, ΤΗΣ ΚΑΤΑΛΛΗΛΟΤΗΤΑΣ ΓΙΑ ΣΥΓΚΕΚΡΙΜΕΝΟ ΣΚΟΠΟ, ΤΗΝ ΑΝΕΞΑΡΤΗΣΙΑ ΑΠΟ ΔΙΚΑΙΩΜΑΤΑ ΤΡΙΤΩΝ Ή ΤΗΝ ΑΠΟΥΣΙΑ ΚΡΥΦΩΝ Ή ΑΛΛΩΝ ΕΛΛΕΙΜΜΑΤΩΝ, ΑΚΡΙΒΕΙΑΣ, Ή ΤΗΣ ΠΑΡΟΥΣΙΑΣ Ή ΑΠΟΥΣΙΑΣ ΣΦΑΛΜΑΤΩΝ, ΕΙΤΕ ΕΙΝΑΙ Ή ΟΧΙ ΔΙΑΠΙΣΤΩΣΙΜΑ. ΟΡΙΣΜΕΝΕΣ ΔΙΚΑΙΟΔΟΣΙΕΣ ΔΕΝ ΕΠΙΤΡΕΠΟΥΝ ΤΟΝ ΑΠΟΚΛΕΙΣΜΟ ΤΩΝ ΥΠΟΝΟΟΥΜΕΝΩΝ ΕΓΓΥΗΣΕΩΝ, ΟΠΟΤΕ Ο ΑΠΟΚΛΕΙΣΜΟΣ ΑΥΤΟΣ ΕΝΔΕΧΕΤΑΙ ΝΑ ΜΗΝ ΙΣΧΥΕΙ ΣΤΗΝ ΠΕΡΙΠΤΩΣΗ ΣΑΣ.

source: Limitation on Liability. EXCEPT TO THE EXTENT REQUIRED BY APPLICABLE LAW, IN NO EVENT WILL LICENSOR BE LIABLE TO YOU ON ANY LEGAL THEORY FOR ANY SPECIAL, INCIDENTAL, CONSEQUENTIAL, PUNITIVE OR EXEMPLARY DAMAGES ARISING OUT OF THIS LICENSE OR THE USE OF THE WORK, EVEN IF LICENSOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
el: Περιορισμός της Ευθύνης. ΕΚΤΟΣ ΕΑΝ ΕΠΙΒΑΛΛΕΤΑΙ ΑΠΟ ΤΟ ΙΣΧΥΟΝ ΔΙΚΑΙΟ, ΣΕ ΚΑΜΙΑ ΠΕΡΙΠΤΩΣΗ ΔΕΝ ΘΑ ΕΙΝΑΙ Ο ΔΙΑΧΕΙΡΙΣΤΗΣ ΑΔΕΙΑΣ ΥΠΕΥΘΥΝΟΣ ΑΠΕΝΑΝΤΙ ΣΑΣ ΣΕ ΚΑΜΙΑ ΝΟΜΙΚΗ ΘΕΩΡΙΑ ΓΙΑ ΟΠΟΙΕΣΔΗΠΟΤΕ ΕΙΔΙΚΕΣ, ΠΑΡΟΡΙΣΜΕΝΕΣ, ΑΠΟΡΡΟΦΗΤΙΚΕΣ Ή ΠΡΟΤΥΠΕΣ ΖΗΜΙΕΣ ΠΟΥ ΠΡΟΚΥΠΤΟΥΝ ΑΠΟ ΑΥΤΗΝ ΤΗΝ ΑΔΕΙΑ Ή ΑΠΟ ΤΗ ΧΡΗΣΗ ΤΟΥ ΕΡΓΟΥ, ΑΚΟΜΑ ΚΑΙ ΑΝ Ο ΔΙΑΧΕΙΡΙΣΤΗΣ ΑΔΕΙΑΣ ΕΧΕΙ ΕΝΗΜΕΡΩΘΕΙ ΓΙΑ ΤΗ ΔΥΝΑΤΟΤΗΤΑ ΤΕΤΟΙΩΝ ΖΗΜΙΩΝ.

source: Termination
el: Λήξη

source: This License and the rights granted hereunder will terminate automatically upon any breach by You of the terms of this License. Individuals or entities who have received Derivative Works or Collective Works from You under this License, however, will not have their licenses terminated provided such individuals or entities remain in full compliance with those licenses. Sections 1, 2, 5, 6, 7, and 8 will survive any termination of this License.
el: Αυτή η Άδεια και τα δικαιώματα που παραχωρούνται σύμφωνα με αυτήν θα λήξουν αυτόματα σε περίπτωση παραβίασης εσάς των όρων αυτής της Άδειας. Άτομα ή εντόμενα που έχουν λάβει Παράγωγα Έργα ή Συλλογικά Έργα από εσάς με βάση αυτήν την Άδεια, ωστόσο, δεν θα έχουν τις άδειές τους ληφθεί αν παραμείνουν πλήρως συμμορφωμένα με αυτές τις άδειες. Οι ενότητες 1, 2, 5, 6, 7 και 8 θα επιζήσουν οποιασδήποτε λήξης αυτής της Άδειας.

source: Subject to the above terms and conditions, the license granted here is perpetual (for the duration of the applicable copyright in the Work). Notwithstanding the above, Licensor reserves the right to release the Work under different license terms or to stop distributing the Work at any time; provided, however that any such election will not serve to withdraw this License (or any other license that has been, or is required to be, granted under the terms of this License), and this License will continue in full force and effect unless terminated as stated above.
el: Υπό τους παραπάνω όρους και προϋποθέσεις, η άδεια που παραχωρείται εδώ είναι διαρκής (για τη διάρκεια των ισχύουσων πνευματικών δικαιωμάτων στο Έργο). Ωστόσο, παρά τα παραπάνω, ο Διαχειριστής Αδείας διατηρεί το δικαίωμα να κυκλοφορήσει το Έργο με διαφορετικούς όρους άδειας ή να σταματήσει τη διανομή του Έργου ανά πάσα στιγμή. Παρέχεται, ωστόσο, ότι τέτοια επιλογή δεν θα έχει ως αποτέλεσμα την ανάκληση αυτής της Άδειας (ή οποιασδήποτε άλλης άδειας που έχει χορηγηθεί, ή υποχρεούται να χορηγηθεί, βάσει των όρων αυτής της Άδειας), και αυτή η Άδεια θα συνεχίσει να ισχύει με πλήρη ισχύ, εκτός αν λυθεί όπως προαναφέρθηκε.

source: Miscellaneous
el: Διάφορα

source: Each time You distribute or publicly digitally perform the Work or a Collective Work, the Licensor offers to the recipient a license to the Work on the same terms and conditions as the license granted to You under this License.
el: Κάθε φορά που διανέμετε ή εκτελείτε δημόσια ψηφιακά το Έργο ή ένα Συλλογικό Έργο, ο Διαχειριστής Άδειας προσφέρει στον παραλήπτη μια άδεια για το Έργο με τους ίδιους όρους και προϋποθέσεις που παραχωρούνται σε εσάς με αυτήν την Άδεια.

source: Each time You distribute or publicly digitally perform a Derivative Work, Licensor offers to the recipient a license to the original Work on the same terms and conditions as the license granted to You under this License.
el: Κάθε φορά που διανέμετε ή εκτελείτε δημόσια ψηφιακά ένα Παράγωγο Έργο, ο Διαχειριστής Άδειας προσφέρει στον παραλήπτη μια άδεια για το αρχικό Έργο με τους ίδιους όρους και προϋποθέσεις που παραχωρούνται σε εσάς με αυτήν την Άδεια.

source: If any provision of this License is invalid or unenforceable under applicable law, it shall not affect the validity or enforceability of the remainder of the terms of this License, and without further action by the parties to this agreement, such provision shall be reformed to the minimum extent necessary to make such provision valid and enforceable.
el: Εάν οποιαδήποτε διάταξη αυτής της Άδειας είναι άκυρη ή μη εφαρμόσιμη σύμφωνα με το ισχύον δίκαιο, αυτό δεν θα επηρεάσει την εγκυρότητα ή την εφαρμοσιμότητα των υπολοίπων όρων αυτής της Άδειας, και χωρίς καμία επιπλέον ενέργεια από τα μέρη σε αυτήν τη συμφωνία, η σχετική διάταξη θα τροποποιηθεί στο ελάχιστο απαραίτητο βαθμό για να γίνει εγκύρη και εφαρμόσιμη.

source: No term or provision of this License shall be deemed waived and no breach consented to unless such waiver or consent shall be in writing and signed by the party to be charged with such waiver or consent.
el: Καμία διάταξη ή όρος αυτής της Άδειας δεν θα θεωρηθεί ως αποδεκτή ή ως συναίνεση σε παράβαση εκτός αν αυτή η αποποίηση ή συναίνεση γίνεται γραπτώς και υπογράφεται από το μέρος που θα πρέπει να αναλάβει αυτήν την αποποίηση ή συναίνεση.

source: This License constitutes the entire agreement between the parties with respect to the Work licensed here. There are no understandings, agreements or representations with respect to the Work not specified here. Licensor shall not be bound by any additional provisions that may appear in any communication from You. This License may not be modified without the mutual written agreement of the Licensor and You.
el: Αυτή η Άδεια αποτελεί τη συνολική συμφωνία μεταξύ των μερών σχετικά με το Έργο που αδειοδοτείται εδώ. Δεν υπάρχουν συμφωνίες, συμφωνίες ή αντιπροσωπείες σχετικά με το Έργο που δεν έχουν καθοριστεί εδώ. Ο Διαχειριστής Άδειας δεν υποχρεούται από επιπρόσθετες διατάξεις που ενδέχεται να περιλαμβάνονται σε οποιαδήποτε επικοινωνία από εσάς. Αυτή η Άδεια δεν μπορεί να τροποποιηθεί χωρίς την αμοιβαία γραπτή συμφωνία του Διαχειριστή Άδειας και εσάς.

source: Creative Commons is not a party to this License, and makes no warranty whatsoever in connection with the Work. Creative Commons will not be liable to You or any party on any legal theory for any damages whatsoever, including without limitation any general, special, incidental or consequential damages arising in connection to this license. Notwithstanding the foregoing two (2) sentences, if Creative Commons has expressly identified itself as the Licensor hereunder, it shall have all rights and obligations of Licensor.
el: Το Creative Commons δεν είναι μέρος σε αυτήν την Άδεια και δεν παρέχει καμία εγγύηση σχετικά με το Έργο. Το Creative Commons δεν θα φέρει καμία ευθύνη έναντί σας ή οποιουδήποτε τρίτου για οποιαδήποτε νομική θεωρία για οποιεσδήποτε ζημίες, συμπεριλαμβανομένων, χωρίς περιορισμό, γενικών, ειδικών, περιστασιακών ή συναφών ζημιών που προκύπτουν σε σχέση με αυτήν την άδεια. Παρά τις δύο (2) προηγούμενες προτάσεις, αν το Creative Commons έχει εκδηλώσει ρητώς τον εαυτό του ως Διαχειριστής Άδειας στα πλαίσια της παρούσας, τότε θα έχει όλα τα δικαιώματα και τις υποχρεώσεις του Διαχειριστή Άδειας.

source: Except for the limited purpose of indicating to the public that the Work is licensed under the CCPL, neither party will use the trademark "Creative Commons" or any related trademark or logo of Creative Commons without the prior written consent of Creative Commons. Any permitted use will be in compliance with Creative Commons' then-current trademark usage guidelines, as may be published on its website or otherwise made available upon request from time to time.
el: Εκτός από τον περιορισμένο σκοπό να δείξει στο κοινό ότι το Έργο είναι αδειοδοτημένο με την CCPL, καμία από τις δύο πλευρές δεν θα χρησιμοποιήσει το εμπορικό σήμα "Creative Commons" ή οποιοδήποτε σχετικό εμπορικό σήμα ή λογότυπο του Creative Commons χωρίς την προηγούμενη γραπτή συγκατάθεση του Creative Commons. Κάθε επιτρεπόμενη χρήση θα πρέπει να συμμορφώνεται με τις τότε ισχύουσες οδηγίες χρήσης εμπορικών σημάτων του Creative Commons, όπως αυτές ενδέχεται να δημοσιευτούν στον ιστότοπό του ή να διατίθενται κατόπιν αιτήματος από καιρό σε καιρό.

source: Creative Commons may be contacted at <ulink url='http://creativecommons.org/' />.
el: Μπορείτε να επικοινωνήσετε με την Creative Commons μέσα από την συγκεκριμένη διεύθυνση <ulink url='http://creativecommons.org/' />.
